[
  {
    "id": 1,
    "title": "Yin Yang (Taijitu)",
    "explanation": "The classic symbol of duality and harmony. Black and white swirl together, reminding us that opposite forces are interconnected and interdependent. Light cannot exist without darkness, and action is balanced by stillness. Embrace the flow of complementary energies in life, seeing unity in apparent contrast.",
    "meaning": "Today, let yourself balance your inner opposites and find harmony in decisions or conflicts."
  },
  {
    "id": 2,
    "title": "Taiji (太極)",
    "explanation": "The Supreme Ultimate represents the origin of all things. From this infinite source arise yin and yang, manifesting the rhythm of the cosmos. It invites contemplation of the infinite and the cyclical nature of life, guiding one to attune with universal order.",
    "meaning": "Today, tune into the flow of the universe and allow events to unfold naturally."
  },
  {
    "id": 3,
    "title": "Bagua (Eight Trigrams)",
    "explanation": "Eight trigrams arranged in a circle, each representing a fundamental principle of nature: heaven, earth, fire, water, wind, thunder, mountain, and lake. Used in Taoist cosmology and the I Ching, it reflects patterns of change, offering insight into choices and destiny.",
    "meaning": "Today, observe patterns around you and consider subtle shifts before making decisions."
  },
  {
    "id": 4,
    "title": "Enso (Zen Circle)",
    "explanation": "A single brushstroke forming a circle, representing emptiness, completeness, and enlightenment. The circle embodies the perfection of imperfection, the transient nature of existence, and the unbroken flow of life. It invites mindfulness and contemplation of the present moment.",
    "meaning": "Today, embrace the present fully and acknowledge your own completeness."
  },
  {
    "id": 5,
    "title": "Lotus Flower",
    "explanation": "Rising from the mud to bloom with pure beauty, the lotus symbolizes purity, awakening, and resilience. Its petals unfold toward the sun, reminding us to grow through adversity, shedding attachments, and embracing enlightenment with grace.",
    "meaning": "Today, find strength in challenges and allow your true beauty to emerge."
  },
  {
    "id": 6,
    "title": "Wu Wei (無為) Calligraphy",
    "explanation": "Representing effortless action, Wu Wei encourages flow with the natural order rather than forcing outcomes. It is the art of acting in harmony with the universe, allowing life to move without unnecessary resistance, embracing simplicity and spontaneous wisdom.",
    "meaning": "Today, act with ease, letting intuition guide your steps without struggle."
  },
  {
    "id": 7,
    "title": "Dragon (龍)",
    "explanation": "A symbol of power, wisdom, and cosmic force, dragons embody spiritual strength and benevolence. They bring transformation, rain for fertility, and protection. Their majestic energy connects heaven and earth, inspiring courage, insight, and visionary action.",
    "meaning": "Today, tap into your inner power and face challenges with wisdom and confidence."
  },
  {
    "id": 8,
    "title": "Ancient Chinese Coin",
    "explanation": "Round with a square hole, representing the union of heaven and earth. Historically used for prosperity, protection, and rituals, it symbolizes material and spiritual abundance, inviting reflection on what wealth and value truly mean.",
    "meaning": "Today, consider abundance beyond material wealth; seek balance between spirit and matter."
  },
  {
    "id": 9,
    "title": "Pearl / Flaming Jewel",
    "explanation": "A luminous gem of enlightenment and cosmic wisdom, often carried by dragons. It radiates clarity, spiritual insight, and illumination, guiding seekers toward truth and higher understanding.",
    "meaning": "Today, open your mind to insight and wisdom that transcends the ordinary."
  },
  {
    "id": 10,
    "title": "Jade Disc (Bi)",
    "explanation": "Circular jade artifacts representing heaven, clarity, and spiritual purity. The smooth surface and precious material invite meditation and connection with celestial order, reminding one of eternal truth and harmony.",
    "meaning": "Today, seek clarity and remain grounded while aspiring to higher ideals."
  },
  {
    "id": 11,
    "title": "Fan",
    "explanation": "A tool of meditation and discipline, the fan symbolizes refinement and hidden wisdom. Unfolding slowly, it teaches patience, the unveiling of knowledge, and the grace of subtle influence.",
    "meaning": "Today, move with patience and reveal your wisdom gently, without force."
  },
  {
    "id": 12,
    "title": "Lantern",
    "explanation": "A source of guidance and illumination, the lantern represents clarity in darkness. It embodies hope, understanding, and enlightenment, lighting the path for oneself and others.",
    "meaning": "Today, act as a light for yourself and those who seek your guidance."
  },
  {
    "id": 13,
    "title": "Incense Burner",
    "explanation": "An emblem of prayer, mindfulness, and presence. Rising smoke connects the earthly with the divine, inviting reflection, meditation, and a calm center in the midst of life’s chaos.",
    "meaning": "Today, cultivate mindfulness and connect with your inner stillness."
  },
  {
    "id": 14,
    "title": "Phoenix (鳳凰)",
    "explanation": "Symbol of renewal, immortality, and balance with the dragon. The phoenix rises from ashes, embodying transformation, resilience, and spiritual grace, guiding the soul through cycles of death and rebirth.",
    "meaning": "Today, embrace transformation and let go of what no longer serves you."
  },
  {
    "id": 15,
    "title": "Tiger (虎)",
    "explanation": "The tiger embodies courage, strength, and yang energy. It represents earthly power, protection, and assertive action, reminding us to act decisively and honor our instincts.",
    "meaning": "Today, trust your strength and courage to face challenges boldly."
  },
  {
    "id": 16,
    "title": "Crane (鶴)",
    "explanation": "A symbol of longevity, peace, and meditation. Cranes soar with elegance and grace, reflecting harmony, spiritual aspiration, and serenity in life.",
    "meaning": "Today, find peace in reflection and take time for quiet contemplation."
  },
  {
    "id": 17,
    "title": "Butterfly (蝶)",
    "explanation": "Representing transformation, the butterfly embodies change, beauty, and Zhuangzi’s dream of fluid reality. It reminds us of the impermanence of life and the joy in metamorphosis.",
    "meaning": "Today, embrace change and allow yourself to transform gracefully."
  },
  {
    "id": 18,
    "title": "Pine Tree (松)",
    "explanation": "Symbol of resilience and immortality, the pine endures harsh seasons while remaining evergreen. It embodies patience, steadfastness, and the eternal flow of life.",
    "meaning": "Today, stay resilient and remain steadfast through challenges."
  },
  {
    "id": 19,
    "title": "Bamboo (竹)",
    "explanation": "A symbol of flexibility, integrity, and strength. Bamboo bends without breaking, representing adaptability, humility, and uprightness in character and spirit.",
    "meaning": "Today, remain flexible and upright, adapting gracefully to circumstances."
  },
  {
    "id": 20,
    "title": "Plum Blossom (梅花)",
    "explanation": "Blooming in winter’s harshness, the plum blossom embodies perseverance, purity, and hope. Its delicate flowers remind us that beauty emerges even in adversity.",
    "meaning": "Today, persevere and find beauty and strength in challenging moments."
  },
  {
    "id": 21,
    "title": "Pan Chang Knot",
    "explanation": "An eternal knot representing cycles, continuity, and infinite flow. Its interwoven lines symbolize harmony, eternal life, and the subtle interconnection of all things.",
    "meaning": "Today, reflect on continuity and your connection to the cycles of life."
  },
  {
    "id": 22,
    "title": "Double Coin Knot",
    "explanation": "A decorative knot symbolizing prosperity, abundance, and balance in wealth. Its interlaced loops remind us of fortune that comes from harmony and careful cultivation.",
    "meaning": "Today, invite prosperity through balance, mindful effort, and harmony."
  },
  {
    "id": 23,
    "title": "Good Luck Knot",
    "explanation": "A charm of blessing and auspiciousness. Its intricate loops weave protection, favor, and good fortune into daily life, reminding one to carry intention and hope in each action.",
    "meaning": "Today, welcome blessings and maintain a hopeful, positive spirit."
  },
  {
    "id": 24,
    "title": "Button Knot",
    "explanation": "Represents unity, safety, and secure connection. Small yet intricate, it emphasizes attention to detail and the interconnectedness of all actions.",
    "meaning": "Today, focus on strengthening bonds and honoring unity in relationships."
  },
  {
    "id": 25,
    "title": "Cloverleaf Knot",
    "explanation": "Symbol of harmony, growth, and natural abundance. Its symmetrical design evokes balance, progress, and flourishing energy in both spiritual and material life.",
    "meaning": "Today, nurture harmony and cultivate growth in your pursuits."
  },
  {
    "id": 26,
    "title": "White Tiger (Baihu, 白虎)",
    "explanation": "Guardian of the West, autumn, and metal element. Represents protection, courage, and disciplined strength, often appearing as a fierce yet noble presence.",
    "meaning": "Today, call upon your courage and protective instincts to defend your values."
  },
  {
    "id": 27,
    "title": "Azure Dragon (Qinglong, 青龙)",
    "explanation": "Guardian of the East, spring, and wood element. Symbolizing power, renewal, and auspicious fortune, the dragon embodies cosmic energy, vitality, and growth.",
    "meaning": "Today, embrace renewal and channel your energy for growth and vitality."
  },
  {
    "id": 28,
    "title": "Vermilion Bird (Zhuque, 朱雀)",
    "explanation": "Guardian of the South, summer, and fire element. A fiery, phoenix-like creature representing rebirth, beauty, and elegance. Inspires transformative energy and the illumination of passions.",
    "meaning": "Today, ignite your creativity and allow your passions to guide you wisely."
  },
  {
    "id": 29,
    "title": "Black Tortoise (Xuanwu, 玄武)",
    "explanation": "Guardian of the North, winter, and water element. Often depicted as a tortoise entwined with a snake, symbolizing longevity, endurance, and wise protection in the cycles of life.",
    "meaning": "Today, embody patience, endurance, and wisdom in facing challenges."
  },
  {
    "id": 30,
    "title": "Qilin (麒麟)",
    "explanation": "A gentle chimera with deer body, dragon scales, and ox tail. The Qilin heralds peace, prosperity, and virtuous leadership. Often seen as a good omen for the birth of sages, inspiring moral integrity and harmony.",
    "meaning": "Today, invite auspiciousness and act with integrity and compassion in your endeavors."
  }
]